// See https://aka.ms/new-console-template for more information
/*
 Задание 1:
Создать класс для подсчета площади треугольников
- реализовать классы для равнобедренного, равностороннего,
прямоугольного и разностороннего треугольника
- для каждого использовать свою формулу для подсчета площади
- площадь разностороннего треугольника считаем по формуле герона
- Создать отдельный класс который будет отвечать за логику создания
треугольников. В нем вернуть нужный объект треугольника проверив его
стороны
- добавить класс квадрат и прямоугольник и логику подсчета площади для него
- добавить класс для реализации иерархии фигур
- создавь массив квадратов, прямоугольник и треугольников и вывести их площади
*/